Конфигурация/Catalogs/ДенежныеПотокиПоОблигациям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ДенежныеПотокиПоОблигациям</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Облигации</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаРасчетаПотока</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Поток</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Купон</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Конфигурация/InformationRegisters/РаспределенияАктивовЕПС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>РаспределенияАктивовЕПС</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиКоличество</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сделка</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сделки</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Рынок</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РынкиЦенныхБумаг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЦеннаяБумага</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумаги</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УчетныйАктивЕПС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеАктивыЕПС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/Enums/РынкиЦенныхБумаг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>РынкиЦенныхБумаг</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Акции</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Облигации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Паи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Векселя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закладные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИпотечныеСертификатыУчастия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДепозитарныеРасписки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Фьючерсы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Опционы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВалютныеПары</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Доли</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДрагоценныеМеталлы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Documents/РегистрацияПредоставленныхКлиентомСведенийОЦенныхБумагах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>РегистрацияПредоставленныхКлиентомСведенийОЦенныхБумагах</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.РешенияКлиентовПоЗначениямЭСП</xr:Item>
				<xr:Item>InformationRegister.АналогиЦенныхБумаг</xr:Item>
				<xr:Item>InformationRegister.ЗначенияНастроекУчетаЦенныхБумаг</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦеннаяБумага</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Облигации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСведений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЭСП</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>УчетныйАктивЕПС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УчетныеАктивыЕПС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Партия</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтрокаПартии</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.СтрокаПартии</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭСП</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЭффективнаяПроцентнаяСтавка</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Используется</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Аналоги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЦеннаяБумага</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Облигации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончанияДействия</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Назначение</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ЦелиИспользованияАналогов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НастройкиУчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>УчетныйАктивЕПС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УчетныеАктивыЕПС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Настройка</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.НастройкиУчетаЦенныхБумаг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеНастройки</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.НастройкиУчетаЦенныхБумаг</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отключить</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Партия</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтрокаПартии</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.СтрокаПартии</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/Catalogs/ДенежныеПотокиПоОблигациям/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтаФорма.Параметры.Свойство("Дата", ЭтаФорма.Дата);
	ЭтаФорма.Параметры.Свойство("Клиент", ЭтаФорма.Клиент);
	ЭтаФорма.Параметры.Свойство("Партия", ЭтаФорма.Партия);
	ЭтаФорма.Параметры.Свойство("СтрокаПартии", ЭтаФорма.СтрокаПартии);
	Если ЭтаФорма.Параметры.Свойство("Отбор") И Объект.Ссылка = Справочники.ДенежныеПотокиПоОблигациям.ПустаяСсылка() Тогда
		Объект.Владелец = ЭтаФорма.Параметры.Отбор.Владелец;
	КонецЕсли;
	
	Если ЭтаФорма.Клиент <> Справочники.ЮрФизЛица.ПустаяСсылка()
		И Объект.Владелец <> Справочники.Облигации.ПустаяСсылка()
		И ЭтаФорма.Дата <> '00010101' Тогда
	
		ЗаполнитьСписокВозможныхУчетныхАктивовЕПС();
	
	КонецЕсли;
	
	Если Объект.Ссылка = Справочники.ДенежныеПотокиПоОблигациям.ПустаяСсылка()
		И Объект.Наименование = "" Тогда
	
		Объект.Наименование = Формат(ЭтаФорма.Дата, "ДФ=dd.MM.yyyy") + ": " + СокрЛП(Объект.Владелец);
	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВозможныхУчетныхАктивовЕПС()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления КАК СчетДоверительногоУправления
		|ПОМЕСТИТЬ _СчетаДУ
		|ИЗ
		|	РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И Клиент = &Клиент) КАК КлиентыДоверительногоУправленияСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	БухПартииЦенныхБумагОстатки.УчетныйАктивЕПС КАК УчетныйАктивЕПС
		|ИЗ
		|	РегистрНакопления.БухПартииЦенныхБумаг.Остатки(
		|			&Период,
		|			ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)
		|				И Организация = &Организация
		|				И СчетДоверительногоУправления В
		|					(ВЫБРАТЬ
		|						_СчетаДУ.СчетДоверительногоУправления
		|					ИЗ
		|						_СчетаДУ)
		|				И ЦеннаяБумага = &ЦеннаяБумага) КАК БухПартииЦенныхБумагОстатки
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РаспределенияАктивовЕПС.УчетныйАктивЕПС
		|ИЗ
		|	РегистрСведений.РаспределенияАктивовЕПС КАК РаспределенияАктивовЕПС
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _СчетаДУ КАК _СчетаДУ
		|		ПО (ВЫРАЗИТЬ(РаспределенияАктивовЕПС.Сделка КАК Документ.Сделка).СчетДоверительногоУправления = _СчетаДУ.СчетДоверительногоУправления)
		|			И (РаспределенияАктивовЕПС.Организация = &Организация
		|				И РаспределенияАктивовЕПС.ЦеннаяБумага = &ЦеннаяБумага)";
	
	Запрос.УстановитьПараметр("Клиент", ЭтаФорма.Клиент);
	Запрос.УстановитьПараметр("Организация", ПараметрыСеанса.ТекущаяОрганизация);
	Запрос.УстановитьПараметр("Период", ЭтаФорма.Дата);
	Запрос.УстановитьПараметр("ЦеннаяБумага", Объект.Владелец);
	
	СписокВозможныхУчетныхАктивовЕПС.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("УчетныйАктивЕПС"));
	
	Если СписокВозможныхУчетныхАктивовЕПС.Количество() = 0 Тогда
		СписокВозможныхУчетныхАктивовЕПС.Добавить(БухгалтерскийУчет.ОпределитьУчетныйАктивЕПС(ЭтаФорма.Дата, Перечисления.РынкиЦенныхБумаг.Облигации, Объект.Владелец));
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьПотокиНаСервере(УчетныйАктивЕПС, Знач УчитыватьРешенияКлиентовПоПотокам, ВернутьРасшифровкуРасчета = Ложь)
	
	Объект.Поток.Очистить();
	
	Отказ				= Ложь;
	РасшифровкаРасчета	= Неопределено;
	
	Если ВернутьРасшифровкуРасчета Тогда
		СтруктураРасшифровки = Новый Структура;
		СтруктураРасшифровки.Вставить("Операции", Новый Массив);
	КонецЕсли;
	
	Если ЭтаФорма.Партия <> Неопределено Тогда // если задана партия - нужно передавать т.к. по одной партии могут быть одни решения, а по другой - другие
		УчитыватьРешенияКлиентовПоПотокам = Новый Структура("УчитыватьРешенияКлиентовПоПотокам, Партия, СтрокаПартии", УчитыватьРешенияКлиентовПоПотокам, ЭтаФорма.Партия, ЭтаФорма.СтрокаПартии);
	КонецЕсли;
	
	ДенежныйПоток = Документы.РегистрацияПредоставленныхКлиентомСведенийОЦенныхБумагах.ПолучитьДенежныйПоток(
		ПараметрыСеанса.ТекущаяОрганизация, ЭтаФорма.Клиент, Объект.Владелец, ЭтаФорма.Дата, УчитыватьРешенияКлиентовПоПотокам, УчетныйАктивЕПС, Отказ, СтруктураРасшифровки);
	
	Если Не Отказ Тогда
		ДенежныйПоток.Колонки.ДатаПотока.Имя = "Дата";
		ДенежныйПоток.Колонки.СуммаПотока.Имя = "Сумма";
			
		Объект.Поток.Загрузить(ДенежныйПоток);
	КонецЕсли;
	
	Если ВернутьРасшифровкуРасчета Тогда
		
		#Область Формирование_расшифровки_расчета
		
		Если СтруктураРасшифровки.Операции.Количество() = 0 Тогда
			Возврат РасшифровкаРасчета;
		КонецЕсли;	
		
		ПараметрыВывода = РаботаСОтчетами.ПодготовитьПараметрыВыводаТаблицыЗначенийВТабличныйДокумент(СтрШаблон("Будущие денежные потоки '%1'", Объект.Владелец), , , РасшифровкаРасчета);
		ПараметрыВывода.Вставить("СобственныйФорматСтрок", Истина);
		
		РаботаСДокументами.СформироватьРасшифровкуОперации(СтруктураРасшифровки, ПараметрыВывода);
		
		#КонецОбласти
		
	КонецЕсли;	
	
	Возврат РасшифровкаРасчета;
	
КонецФункции

&НаКлиенте
Процедура КомандаЗаполнитьПотоки(Команда)

	Если СписокВозможныхУчетныхАктивовЕПС.Количество() = 0 Тогда
		ЗаполнитьСписокВозможныхУчетныхАктивовЕПС();
	КонецЕсли;
	
	Если СписокВозможныхУчетныхАктивовЕПС.Количество() = 1 Тогда
		УчетныйАктивЕПС = СписокВозможныхУчетныхАктивовЕПС[0].Значение;
	Иначе
		ВыбранныйЭлемент = СписокВозможныхУчетныхАктивовЕПС.ВыбратьЭлемент("Выберите учетный актив");
		Если ВыбранныйЭлемент = Неопределено Тогда
			Возврат;
		КонецЕсли;
		УчетныйАктивЕПС = ВыбранныйЭлемент.Значение;
	КонецЕсли;
	
	ЗаполнитьПотокиНаСервере(УчетныйАктивЕПС, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнитьПотокиБезПрофсуждений(Команда)
	
	ОтветНаВопрос				= Вопрос("Вывести расшифровку расчета будущих денежных потоков?", РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет);
	ВывестиРасшифровкуРасчета	= (ОтветНаВопрос = КодВозвратаДиалога.Да);
	
	Если СписокВозможныхУчетныхАктивовЕПС.Количество() = 0 Тогда
		ЗаполнитьСписокВозможныхУчетныхАктивовЕПС();
	КонецЕсли;
	
	Если СписокВозможныхУчетныхАктивовЕПС.Количество() = 1 Тогда
		УчетныйАктивЕПС = СписокВозможныхУчетныхАктивовЕПС[0].Значение;
	Иначе
		ВыбранныйЭлемент = СписокВозможныхУчетныхАктивовЕПС.ВыбратьЭлемент("Выберите учетный актив");
		Если ВыбранныйЭлемент = Неопределено Тогда
			Возврат;
		КонецЕсли;
		УчетныйАктивЕПС = ВыбранныйЭлемент.Значение;
	КонецЕсли;
	
	РасшифровкаРасчета = ЗаполнитьПотокиНаСервере(УчетныйАктивЕПС, Ложь, ВывестиРасшифровкуРасчета);
	
	Если РасшифровкаРасчета <> Неопределено Тогда
		РасшифровкаРасчета.Показать(СтрШаблон("Расчет потоков '%1'", Объект.Владелец));
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СверитьСПотокамиБезПрофсужденийНаСервере()
	
	Отказ = Ложь;
	
	ПотокиРасчетные = Документы.РегистрацияПредоставленныхКлиентомСведенийОЦенныхБумагах.ПолучитьДенежныйПоток(
		ПараметрыСеанса.ТекущаяОрганизация, ЭтаФорма.Клиент, Объект.Владелец, ЭтаФорма.Дата, Ложь, , Отказ);
	
	ПотокиРасчетные.Колонки.ДатаПотока.Имя = "Дата";
	ПотокиРасчетные.Колонки.СуммаПотока.Имя = "Сумма";

		
	Если Отказ Тогда
		Возврат "Не удалось получить денежные потоки";
	КонецЕсли;
	
	ПотокиДокумента = Объект.Потоки.Выгрузить();
	
	// Сверка однородных данных
	
	ОписаниеНабора = Новый Структура;
	ОписаниеНабора.Вставить("КлючевыеПоля",			"Дата");
	ОписаниеНабора.Вставить("Ресурсы",				"Сумма");
	ОписаниеНабора.Вставить("ДанныеВнешнейСистемы",	ПотокиРасчетные);
	ОписаниеНабора.Вставить("ДанныеУчетнойСистемы",	ПотокиДокумента);

	НаборыДанных = Новый Массив;
	НаборыДанных.Добавить(ОписаниеНабора);
			
	Заголовки = Новый Структура;
	Заголовки.Вставить("Дата",  "Дата");
	Заголовки.Вставить("Сумма", "Сумма");

	ДанныеДляСверки = Новый Структура;
	ДанныеДляСверки.Вставить("ЗаголовокОтчета",				"Сверка с потоками без профсуждений");
	ДанныеДляСверки.Вставить("ПредставлениеУчетнойСистемы",	"Данные документа");
	ДанныеДляСверки.Вставить("ПредставлениеВнешнейСистемы",	"Расчетные данные");
	ДанныеДляСверки.Вставить("ПараметрыОтчета",				Новый Структура);
	ДанныеДляСверки.Вставить("НаборыДанных",				НаборыДанных);
	ДанныеДляСверки.Вставить("Заголовки",					Заголовки);
	
	ОтчетОРасхождениях	= Новый ТабличныйДокумент;
	ЕстьРасхождения		= Ложь;
	
	РаботаСОтчетами.ЗаполнитьОтчетОРасхожденияхНаборовДанных(ДанныеДляСверки, ОтчетОРасхождениях, ЕстьРасхождения);
	
	Возврат ?(ЕстьРасхождения, ОтчетОРасхождениях, "Потоки совпадают!");
	
КонецФункции

&НаКлиенте
Процедура КомандаСверитьСПотокамиБезПрофсуждений(Команда)
	
	Расхождения = СверитьСПотокамиБезПрофсужденийНаСервере();
	
	Если ТипЗнч(Расхождения) = Тип("Строка") Тогда
		Предупреждение(Расхождения);
	ИначеЕсли Расхождения <> Неопределено Тогда
		Расхождения.Показать(СтрШаблон("Расхождения потоков '%1'", Объект.Владелец));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаРассчитатьЭСПпоПотоку(Команда)
	
	ОтчетРасчетЭСП = ОбщегоНазначения.ПолучитьИменованныйОбъект("ОтчетРасчетЭСП");
	ИмяПодключенногоОбъекта = РаботаСДополнительнымиОтчетамиИОбработками.ПодключитьВнешнююОбработку(ОтчетРасчетЭСП);
	
	ФормаОтчета = ПолучитьФорму("ВнешняяОбработка." + ИмяПодключенногоОбъекта + ".Форма", );
	
	ФормаОтчета.Дата = НачалоДня(ЭтаФорма.Дата);
	ФормаОтчета.Цена = 1000;

	ФормаОтчета.ДенежныйПоток.Очистить();
	
	Для каждого СтрокаПотока Из Объект.Поток Цикл
	
		СтрокаПотокаНаФорме = ФормаОтчета.ДенежныйПоток.Добавить();
		СтрокаПотокаНаФорме.Дата = СтрокаПотока.Дата;
		СтрокаПотокаНаФорме.Поток = СтрокаПотока.Сумма;
	
	КонецЦикла;

	ФормаОтчета.РасчетИзДокументаРегистрации();
	
КонецПроцедуры
